mesh_convergence/CpD18_level2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../caseSetup"

convertToMeters 1;

/*
    
   3___________  2        
   /__________/|
 7| |       6| | 
  | |        | |
  | |        | |
  | |        | |  
  | |_0______|_| 1
  |/_________|/
 4           5 

*/

vertices
(
    ($xmin $ymin $zmin)  // 0
    ($xmax $ymin $zmin)  // 1
    ($xmax $ymax $zmin)  // 2
    ($xmin $ymax $zmin)  // 3
    ($xmin $ymin $zmax)  // 4
    ($xmax $ymin $zmax)  // 5
    ($xmax $ymax $zmax)  // 6
    ($xmin $ymax $zmax)  // 7
);

Mxmin #calc "-1.0*$xmin";
Mymin #calc "-1.0*$ymin";
Mzmin #calc "-1.0*$zmin";


nx #calc "std::round(($CpD*($xmax+$Mxmin))/(0.0316))";
ny #calc "std::round(($nx*($ymax+$Mymin))/($xmax+$Mxmin))";
nz #calc "std::round(($nx*($zmax+$Mzmin))/($xmax+$Mxmin))";

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7) 
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    bottom
    {
        type symmetry;
        faces
        (
            (4 5 1 0) 
        );
    }
    top
    {
        type symmetry;
        faces
        (
            (7 6 2 3) 
        );
    }
    left
    {
        type symmetry;
        faces
        (
            (4 0 3 7)
        );
    } 
    right
    {
        type symmetry;
        faces
        (
            (5 1 2 6)  
        );
    }
               
);

mergePatchPairs
(
);

// ************************************************************************* //
